tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
#include "FarmFeederApp.h"

#include <Arduino.h>
#include <Esp32Base.h>

#include <time.h>
#include <Wire.h>

#include "FeederBucket.h"
#include "FeederBucketRestore.h"
#include "FeederController.h"
#include "FeederPersistenceStore.h"
#include "FeederRecordFileStore.h"
#include "FeederRecordLog.h"
#include "FeederRunTracker.h"
#include "FeederSchedule.h"
#include "FeederStorageLayout.h"
#include "FeederTarget.h"
#include "FeederToday.h"

namespace {

FeederController g_feeder;
FeederControllerConfig g_feederConfig;
FeederScheduleService g_schedules;
FeederBucketService g_buckets;
FeederTargetService g_targets;
FeederTodayService g_today;
FeederRunTracker g_runs;
FeederRecordLog g_records;
uint16_t g_lastScheduleMinute = 24 * 60;
uint32_t g_lastScheduleDate = 0;
bool g_recordStorageReady = false;
Esp32At24cRecordStore::ArduinoWireI2cBus g_at24cBus;
Esp32At24cRecordStore::At24cI2cDevice g_at24cDevice(g_at24cBus, {});
Esp32At24cRecordStore::RecordStore g_at24cStore;
bool g_at24cStoreReady = false;

static constexpr uint8_t kFarmFeederRouteCount = 29;
static constexpr uint8_t kFeederI2cSda = 21;
static constexpr uint8_t kFeederI2cScl = 22;
static constexpr const char* kFeederRecordRootDir = "/records";
static constexpr const char* kFeederRecordDir = "/records/feeder";
static constexpr const char* kFeederRecordCurrentPath = "/records/feeder/current.far";
static constexpr uint32_t kFeederRecordMaxCurrentBytes = 64UL * 1024UL;
static constexpr uint8_t kFeederRecordMaxArchives = 16;
static_assert(ESP32BASE_WEB_MAX_ROUTES >= kFarmFeederRouteCount,
              "Esp32FarmFeeder requires ESP32BASE_WEB_MAX_ROUTES >= 29");

uint8_t configuredChannelMask() {
  return static_cast<uint8_t>((1U << kFeederConfiguredChannels) - 1U);
}

bool validAppChannel(uint8_t channel) {
  return channel < kFeederConfiguredChannels;
}

void addFarmFeederApi(const char* path, Esp32BaseWeb::Handler handler) {
  if (!Esp32BaseWeb::addApi(path, handler)) {
    ESP32BASE_LOG_E("farmfeeder", "api_route_register_failed path=%s", path);
  }
}

void syncFeederConfigFromBaseInfo() {
  g_feederConfig.enabledChannelMask = static_cast<uint8_t>(
      g_buckets.enabledChannelMask() & g_feederConfig.installedChannelMask & configuredChannelMask());
  const FeederCommandResult result = g_feeder.configure(g_feederConfig);
  g_runs.stopAll();
  if (result != FeederCommandResult::Ok) {
    ESP32BASE_LOG_E("farmfeeder", "feeder_config_sync_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

bool at24cWriteOk(Esp32At24cRecordStore::Result result) {
  return result == Esp32At24cRecordStore::Result::Ok ||
         result == Esp32At24cRecordStore::Result::Unchanged;
}

void persistFeederScheduleIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result =
      saveFeederSchedule(g_at24cStore, g_schedules.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "schedule_save_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

void persistFeederTodayIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result = saveFeederToday(g_at24cStore, g_today.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "today_save_failed result=%u", static_cast<unsigned>(result));
  }
}

void persistFeederTargetsIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result =
      saveFeederTargets(g_at24cStore, g_targets.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "targets_save_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

void persistFeederBucketsIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result =
      saveFeederBuckets(g_at24cStore, g_buckets.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "buckets_save_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

void persistFeederCalibrationIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result =
      saveFeederCalibration(g_at24cStore, g_buckets.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "calibration_save_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

void initializeFeederAt24cStore() {
  const Esp32At24cRecordStore::Result beginResult =
      g_at24cStore.begin(g_at24cDevice,
                         kFeederAt24cConfig,
                         kFeederAt24cRegions,
                         kFeederAt24cRegionCount);
  if (beginResult != Esp32At24cRecordStore::Result::Ok) {
    ESP32BASE_LOG_W("farmfeeder", "at24c_store_begin_failed result=%u",
                    static_cast<unsigned>(beginResult));
    return;
  }
  g_at24cStoreReady = true;

  FeederScheduleSnapshot schedule;
  if (loadFeederSchedule(g_at24cStore, schedule) == Esp32At24cRecordStore::Result::Ok &&
      g_schedules.restore(schedule) == FeederScheduleResult::Ok) {
    g_lastScheduleDate = schedule.serviceDate;
  }

  FeederTodaySnapshot today;
  if (loadFeederToday(g_at24cStore, today) == Esp32At24cRecordStore::Result::Ok) {
    g_today.restore(today);
  }

  FeederTargetSnapshot targets;
  if (loadFeederTargets(g_at24cStore, targets) == Esp32At24cRecordStore::Result::Ok) {
    g_targets.restore(targets);
  }

  FeederBucketSnapshot calibration;
  FeederBucketSnapshot dynamicBuckets;
  const bool hasCalibration =
      loadFeederCalibration(g_at24cStore, calibration) == Esp32At24cRecordStore::Result::Ok;
  const bool hasDynamicBuckets =
      loadFeederBuckets(g_at24cStore, dynamicBuckets) == Esp32At24cRecordStore::Result::Ok;
  if (hasCalibration && hasDynamicBuckets) {
    restoreFeederBucketParts(g_buckets, calibration, dynamicBuckets);
  } else if (hasCalibration) {
    g_buckets.restore(calibration);
  }

  syncFeederConfigFromBaseInfo();
}

const char* deviceStateName(FeederDeviceState state) {
  switch (state) {
    case FeederDeviceState::Idle: return "Idle";
    case FeederDeviceState::Running: return "Running";
    case FeederDeviceState::Degraded: return "Degraded";
    case FeederDeviceState::Fault: return "Fault";
  }
  return "Unknown";
}

const char* channelStateName(FeederChannelState state) {
  switch (state) {
    case FeederChannelState::Disabled: return "Disabled";
    case FeederChannelState::Idle: return "Idle";
    case FeederChannelState::Running: return "Running";
    case FeederChannelState::Completed: return "Completed";
    case FeederChannelState::Fault: return "Fault";
  }
  return "Unknown";
}

